<?php
$title = "Обо мне";
include_once "header.php";
?>

<section class="about section-bg">
    <div class="about__container">
        <div class="about__info">
        <div class="about__info-title">Обо мне</div>
        <div class="about__info-text">
            Как вы уже выяснили, зовут меня Вова. Я живу в Ульяновске, 
            мне 18 лет и я являюсь студентом местного технического университета. 
            Я только учусь быть настоящим программистом, так что мои навыки
            сейчас желают иметь лучшего. У меня, на удивление для самого себя
            достаточно много интересов (подробнее о них на соответствующей странице). 
            Я достаточно скромный, однако, если вы со мной знакомы, то вы скажете совсем
            обратное. Я не знаю, что ещё вам рассказать, если вы хотите узнать обо мне
            больше, то можете связаться со мной через соц. сети.
        </div>
        </div>
        
        <img class="about__img" src="img/about-img.jpg" alt="" >
    </div>
</section>

<?php
include_once "footer.php";
?>

</body>

</html>



