<?php
$title = "Хобби";
include_once "header.php";
?>

<section class="hobby section-bg">
    <div class="hobby__container">
        <div class="hobby__blocks">

            <div class="hobby__blocks-item">
                <div class="hobby__info">
                    <div class="hobby__info-title">Программирование</div>
                    <img src="img/programming.jpg" alt="" class="hobby__info-img">
                </div>
                <div class="hobby__blocks-text">
                    Программирование - это процесс создания программ. Для этого
                    программисты пишут исходный код на одном языков программированя.
                    Сам я занялся программированием не очень давно, примерно в 16 лет,
                    когда мой старший брат посоветовал начать этим заниматься, так как
                    область IT в целом развивалась в то время очень стремительно, и
                    хороших программистов действительно не хватало, как и по сей день.
                    Я начал своё изучение с такого языка как Python, и меня это очень
                    увлекло, и я сразу же пытался написать нечто интересное и возможно
                    полезное. Моя первая действительно полноценная программа - перевод
                    из любой системы счисления до девятиричной в десятичную. После
                    я перешел на написание дискорд ботов, чем занимаюсь по сей день.

                </div>
            </div>

            <div class="hobby__blocks-item">
                <div class="hobby__info">
                    <div class="hobby__info-title">Формула 1</div>
                    <img src="img/formula1.jpg" alt="" class="hobby__info-img">
                </div>
                <div class="hobby__blocks-text">
                    Формула 1 - чемпионат мира по кольцевым гонкам, который проводится
                    ежегодно и состоит из множества этапов. Многие считают, что очень скучно
                    смотреть на то, как "машинки ездят по кругу", я тоже так думал, однако, посмотрев
                    один этап формулы 1 я не заметил как пролетело 2 часа! Постоянные обгоны, борьба
                    за позиции, за победу, интересные тактики пит-стопов, которые не только позволяют
                    выиграть позицию, а выиграть целую гонку! Моя увлеченность Формулой 1 началась ещё
                    с раннего детства, когда я впервые увидел ее по телевизору. С того момента я в целом
                    начал увлекаться гонками и машинами. Однако конкретная увлеченность и интерес пришли 
                    лишь в 2021 году, когда я увидел Гран-при монако дома у брата. С того момента я посмотрел
                    каждое Гран-при.
                </div>
            </div>

            <div class="hobby__blocks-item">
                <div class="hobby__info">
                    <div class="hobby__info-title">Компьютерные игры</div>
                    <img src="img/games.jpg" alt="" class="hobby__info-img">
                </div>
                <div class="hobby__blocks-text">
                    Компьютерные игры. Ну кто ими не увлекался из старшего и моего поколения. 
                    С компьютерными играми, в очередной раз, познакомил меня мой страший брат, когда
                    мне было 5 лет. Впервые тогда я поиграл в GTA Vice City. Всем чем я занимался это
                    просто бегал по городу и бил прохожих, это было достаточно весело. Однако моей полноценной
                    первой игрой стала Need For Speed Underground. Я думаю понятно почему это стало именно
                    серия Need For Speed. Далее я очень много играл в различные серии игр Need For Speed в том
                    числе и мою любимую NFS Carbon. На данный момент я увлекаюсь такими играми как Destiny 2, 
                    серии игр Formula 1, Minecraft и много много ещё каких игр.
                </div>
            </div>

            <div class="hobby__blocks-item">
                <div class="hobby__info">
                    <div class="hobby__info-title">Симрейсинг</div>
                    <img src="img/simracing.jpg" alt="" class="hobby__info-img">
                </div>
                <div class="hobby__blocks-text">
                    Симрейсинг - с английского языка - моделирование гонок или симуляция гонок. 
                    Это гоночные игры, которые максимально приближены к реальности, они максимально
                    пытаются имитировать реальные автогонки и их аспекты: расход топлива, повреждения,
                    износ шин, сцепление с дорогой и так далее. Для таких игр не достаточно просто клавиатуры
                    с мышкой, для таких игр требуется серьёзное обурудование, такое как руль и педали, причём
                    не просто самые базовые, а достаточно продвинутые. Данное увлечение безумно дорогостощее, 
                    однако оно позволяет погрузиться в мир автоспорта без риска для здоровья, оно позволяет
                    познать как чувствуют себя пилоты в реальной гонке, что они чувствуют во время гонки и так далее.
                </div>
            </div>
        </div>
    </div>
</section>

<?php
include_once "footer.php";
?>

</body>

</html>